Dmivaka/STM32H7-ETH-LWIP/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "lwip.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "net.h"
#include "helpers.h"
#include <string.h>

#include "stm32h7xx_ll_gpio.h"
#include "stm32h7xx_ll_spi.h"

#include "lwip.h"
#include "lwip/udp.h"

#include "uavcan.h"

#include "circular_heap.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

FDCAN_HandleTypeDef hfdcan1;
FDCAN_HandleTypeDef hfdcan2;
FDCAN_HandleTypeDef hfdcan3;

SPI_HandleTypeDef hspi3;
SPI_HandleTypeDef hspi4;
DMA_HandleTypeDef hdma_spi3_rx;
DMA_HandleTypeDef hdma_spi4_tx;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim7;

/* USER CODE BEGIN PV */
FDCAN_HandleTypeDef * FDCAN_Handles_Map[3] = {&hfdcan1, &hfdcan2, &hfdcan3};

circular_heap_t spi_tx_heap;
queue spi_tx_queue = {NULL, NULL};

#pragma location=0x24000000
uint8_t SPI_TX_buf[16384] = {0};

#pragma location=0x30007C00
uint8_t SPI_RX_body[1024] = {0};

uint32_t SPI_RX_HEAD = 0;
uint32_t SPI_RX_TAIL = 0;
uint32_t SPI_RX_LAST_TAIL = 0;

extern uint8_t LCM_rx_flag;
extern uint8_t LCM_tx_flag;

uint8_t indicators_state[3] = { 0 };
uint16_t indicators_pins[3] = { CAN1_ind_Pin, CAN2_ind_Pin, CAN3_ind_Pin };
GPIO_TypeDef *indicators_ports[3] = { CAN1_ind_GPIO_Port, CAN2_ind_GPIO_Port, CAN3_ind_GPIO_Port };
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_TIM1_Init(void);
static void MX_FDCAN1_Init(void);
static void MX_FDCAN2_Init(void);
static void MX_FDCAN3_Init(void);
static void MX_SPI3_Init(void);
static void MX_TIM7_Init(void);
static void MX_SPI4_Init(void);
/* USER CODE BEGIN PFP */
void UDP_TX_send( uint16_t *UDP_TX_level );
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
extern uint64_t TIM7_ITs;
uint64_t micros()
{ 
  return (uint64_t)(__HAL_TIM_GET_COUNTER(&htim7) + 50000u * TIM7_ITs);
}

uint32_t previos_char = 9000;

uint8_t debug_collector[1024] = {0};
uint32_t debug_index = 0;

extern struct udp_pcb *upcb;

uint8_t can1_tx_buffer[4096] = {0};
circular_heap_t can1_tx_heap;
queue can1_tx_queue = {NULL, NULL};

uint8_t can2_tx_buffer[4096] = {0};
circular_heap_t can2_tx_heap;
queue can2_tx_queue = {NULL, NULL};

uint8_t can3_tx_buffer[4096] = {0};
circular_heap_t can3_tx_heap;
queue can3_tx_queue = {NULL, NULL};

queue *can_tx_queues[3] = { &can1_tx_queue, &can2_tx_queue, &can3_tx_queue };
circular_heap_t *can_tx_heaps[3] = { &can1_tx_heap, &can2_tx_heap, &can3_tx_heap };

FDCAN_ErrorCountersTypeDef can_error_count[3] = {0};
FDCAN_ProtocolStatusTypeDef can_protocol_stat[3] = {0};

struct pbuf *UDP_TX_buf = NULL;
#define UDP_TX_size 128

//#define uavcan_en

uint8_t MY_IP_ADDRESS[4] = {10, 127, 0, 2};
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  circular_heap_init(&spi_tx_heap, SPI_TX_buf, 16384);

  circular_heap_init(&can1_tx_heap, can1_tx_buffer, 4096);
  circular_heap_init(&can2_tx_heap, can2_tx_buffer, 4096);
  circular_heap_init(&can3_tx_heap, can3_tx_buffer, 4096);
  
  UAVCAN_setup();

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

/* Configure the peripherals common clocks */
  PeriphCommonClock_Config();

  /* USER CODE BEGIN SysInit */
  __HAL_RCC_D2SRAM1_CLK_ENABLE(); // have no idea how to do this from the CubeMX software.
  HAL_Delay(1000); // does not work without this line. I believe it's linked to lan8720 start-up time. 
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_TIM1_Init();
  MX_FDCAN1_Init();
  MX_FDCAN2_Init();
  MX_FDCAN3_Init();
  MX_LWIP_Init();
  MX_SPI3_Init();
  MX_TIM7_Init();
  MX_SPI4_Init();
  /* USER CODE BEGIN 2 */
  uint16_t UDP_TX_level = 0;
  UDP_TX_buf = pbuf_alloc(PBUF_TRANSPORT, UDP_TX_size, PBUF_RAM); // allocate LWIP memory for outgoing UDP packet
  
  HAL_SPI_Receive_DMA(&hspi3, SPI_RX_body, 1024);

  udp_client_connect();
  udp_lcm_connect();
  
